Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: .Jessica's topic branch.
cs: .Jessičina tématická větev.

source: .John's divergent history.
cs: .Johnova odchylující se historie.

source: .John's history after pushing to the `origin` server.
cs: .Johnova historie po odeslání revize na server `origin`.

source: .John's repository after merging `origin/master`.
cs: .Johnův repozitář po začlenění `origin/master`.

source: .Local and remote work can diverge image::images/remote-branches-2.png[Local and remote work can diverge.]
cs: .Lokální a vzdálená historie práce se může rozcházet image::images/remote-branches-2.png[Lokální a vzdálená historie práce se může rozcházet.]

source: .Local version control.
cs: .Lokální správa verzí.

source: .Merging to integrate diverged work history image::images/basic-rebase-2.png[Merging to integrate diverged work history.]
cs: .Spojení rozvětvené historie sloučením image::images/basic-rebase-2.png[Spojení rozvětvené historie sloučením.]

source: .Multiple topic branches image::images/topic-branches-1.png[Multiple topic branches.]
cs: .Více tématických větví image::images/topic-branches-1.png[Více tématických větví.]

source: .Output of `git diff --check`.
cs: .Výstup příkazu `git diff --check`.

source: .Rebasing a topic branch off another topic branch image::images/interesting-rebase-2.png[Rebasing a topic branch off another topic branch.]
cs: .Přeskládání tématické větve vzniklé odvětvením z jiné tématické větve image::images/interesting-rebase-2.png[Přeskládání tématické větve vzniklé odvětvením z jiné tématické větve.]

source: .Rebasing the change introduced in `C4` onto `C3` image::images/basic-rebase-3.png[Rebasing the change introduced in `C4` onto `C3`.]
cs: .Přeskládání změn vzniklých v `C4` na `C3` image::images/basic-rebase-3.png[Přeskládání změn vzniklých v `C4` na `C3`.]

source: .Remote tracking branch for `teamone/master` image::images/remote-branches-5.png[Remote tracking branch for `teamone/master`.]
cs: .Vzdáleně sledovaná větev pro `teamone/master` image::images/remote-branches-5.png[Vzdáleně sledovaná větev pro `teamone/master`.]

source: .Server and local repositories after cloning image::images/remote-branches-1.png[Server and local repositories after cloning.]
cs: .Repozitář na serveru a lokální repozitář po klonování image::images/remote-branches-1.png[Repozitář na serveru a lokální repozitář po klonování.]

source: .Simple divergent history image::images/basic-rebase-1.png[Simple divergent history.]
cs: .Jednoduché rozvětvení historie image::images/basic-rebase-1.png[Jednoduché rozvětvení historie.]

source: .Storing data as changes to a base version of each file.
cs: .Ukládání dat jako změn vůči základní verzi každého souboru.

source: .Storing data as snapshots of the project over time.
cs: .Ukládání dat v podobě snímků projektu v daném čase.

source: .The HEAD branch moves forward when a commit is made image::images/advance-testing.png[The HEAD branch moves forward when a commit is made.]
cs: .Větev HEAD se při zápisu revize posune vpřed image::images/advance-testing.png[Větev HEAD se při zápisu revize posune vpřed.]

source: .The iss53 branch has moved forward with your work image::images/basic-branching-3.png[The iss53 branch has moved forward with your work.]
cs: .Větev iss53 se při práci posunula vpřed image::images/basic-branching-3.png[Větev iss53 se při práci posunula vpřed.]

source: .The lifecycle of the status of your files.
cs: .Cyklus stavů vašich souborů.

source: .Three snapshots used in a typical merge image::images/basic-merging-1.png[Three snapshots used in a typical merge.]
cs: .Při typickém slučování se používají tři snímky image::images/basic-merging-1.png[Při typickém slučování se používají tři snímky.]

source: .Two branches pointing into the same series of commits image::images/two-branches.png[Two branches pointing into the same series of commits.]
cs: .Dvě větve ukazují na stejnou sérii objektů revize image::images/two-branches.png[Dvě větve ukazují na stejnou sérii objektů revize.]

source: .Work continues on `iss53` image::images/basic-branching-6.png[Work continues on `iss53`.]
cs: .Pokračuje práce na větvi `iss53` image::images/basic-branching-6.png[Pokračuje práce na větvi `iss53`.]

source: .Working directory, staging area, and Git directory.
cs: .Pracovní adresář, oblast připravených změn a adresář Git.

source: .`git fetch` updates your remote references image::images/remote-branches-3.png[`git fetch` updates your remote references.]
cs: .`git fetch` aktualizuje reference do vzdáleného repozitáře image::images/remote-branches-3.png[`git fetch` aktualizuje reference do vzdáleného repozitáře.]

source: .`master` is fast-forwarded to `hotfix` image::images/basic-branching-5.png[`master` is fast-forwarded to `hotfix`.]
cs: .Větev `master` se přesunula „rychle vpřed“ na `hotfix` image::images/basic-branching-5.png[Větev `master` se přesunula „rychle vpřed“ na `hotfix`.]

source: <<_git_branching>> will go over branches and references in detail.
cs: V kapitole <<_git_branching>> se větvemi a referencemi budeme zabývat podrobně.

source: <<_git_on_the_server>> will introduce all of the available options the server can set up to access your Git repository and the pros and cons of each.
cs: V kapitole <<_git_on_the_server>> budou uvedeny všechny dostupné možnosti, které mohou být na serveru pro přístup do gitového repozitáře nastaveny, včetně jejich předností a nevýhod.

source: <<_rewriting_history>> describes a number of useful Git tricks for rewriting history and interactively staging files – use these tools to help craft a clean and understandable history before sending the work to someone else.
cs: Podkapitola <<_rewriting_history>> popisuje několik užitečných triků, jak v systému Git přepsat historii a jak interaktivně připravovat soubory k zapsání. Než svou práci odešlete ostatním, použijte tyto nástroje k udržení čisté a srozumitelné historie.

source: <<log_options>> lists the options we've covered so far, as well as some other common formatting options that may be useful, along with how they change the output of the log command.
cs: Tabulka <<log_options>> uvádí seznam voleb, které jsme zatím probrali, a také pár dalších voleb pro formátování, které se mohou hodit -- spolu s popisem toho, jak mění výstup příkazu `log`.

source: <<pretty_format>> lists some of the more useful options that format takes.
cs: Tabulka <<pretty_format>> uvádí některé z užitečnějších značek, které předpis `format` akceptuje.

source: == Git and Other Systems
cs: == Git a ostatní systémy

source: == Git on the Server
cs: == Git na serveru

source: === A Short History of Git
cs: === Stručná historie systému Git

source: === About Version Control
cs: === Správa verzí

source: === Basic Branching and Merging
cs: === Základy větvení a slučování

source: === Branching Workflows
cs: === Postupy při práci s větvemi

source: === Contributing to a Project
cs: === Přispívání do projektu

source: === Debugging with Git
cs: === Ladění v systému Git

source: === Distributed Workflows
cs: === Distribuované pracovní postupy

source: === Git Attributes
cs: === Atributy Git

source: === Git Basics
cs: === Základy systému Git

source: === Git Daemon
cs: === Démon Git

source: === Installing Git
cs: === Instalace systému Git

source: === Maintaining a Project
cs: === Správa projektu

source: === Maintenance and Data Recovery
cs: === Správa a obnova dat

source: === Packfiles
cs: === Balíčkové soubory

source: === Recording Changes to the Repository
cs: === Nahrávání změn do repozitáře

source: === Summary
cs: === Shrnutí

source: === The Command Line
cs: === Příkazový řádek

source: === The Protocols
cs: === Protokoly

source: === Transfer Protocols
cs: === Přenosové protokoly

source: ==== Adding Collaborators
cs: ==== Přidávání spolupracovníků

source: ==== Adding Remote Repositories
cs: ==== Přidávání vzdálených repozitářů

source: ==== Ancestry References
cs: ==== Reference podle původu

source: ==== Basic Client Configuration
cs: ==== Základní konfigurace klienta

source: ==== Binary Files
cs: ==== Binární soubory

source: ==== Centralized Version Control Systems
cs: ==== Centralizované systémy správy verzí

source: ==== Centralized Workflow
cs: ==== Centralizovaný pracovní postup

source: ==== Checking Your Settings
cs: ==== Kontrola vašeho nastavení

source: ==== Checking out Tags
cs: ==== Získání označené pracovní kopie

source: ==== Client-Side Hooks
cs: ==== Zásuvné moduly na straně klienta

source: ==== Colors in Git
cs: ==== Barvy systému Git

source: ==== Creating Tags
cs: ==== Vytváření značek

source: ==== Creating a Branch from a Stash
cs: ==== Vytvoření větve z odkladu

source: ==== Creating a New Repository
cs: ==== Vytvoření nového repozitáře

source: ==== Deleting References
cs: ==== Mazání referencí

source: ==== Dictator and Lieutenants Workflow
cs: ==== Pracovní postup s diktátorem a poručíky

source: ==== Distributed Version Control Systems
cs: ==== Distribuované systémy správy verzí

source: ==== Exporting Your Repository
cs: ==== Export repozitáře

source: ==== Forking Projects
cs: ==== Odštěpení projektů

source: ==== Formatting and Whitespace
cs: ==== Formátování a prázdné znaky

source: ==== Git Generally Only Adds Data
cs: ==== Git obvykle jen přidává data

source: ==== Git Has Integrity
cs: ==== Git udržuje integritu

source: ==== Initializing a Repository in an Existing Directory
cs: ==== Inicializace repozitáře v existujícím adresáři

source: ==== Installing a Hook
cs: ==== Instalace zásuvného modulu

source: ==== Installing from Source
cs: ==== Instalace ze zdrojových souborů

source: ==== Installing on Linux
cs: ==== Instalace v Linuxu

source: ==== Installing on Mac
cs: ==== Instalace pro Mac

source: ==== Installing on Windows
cs: ==== Instalace v systému Windows

source: ==== Integrating Contributed Work
cs: ==== Integrace příspěvků

source: ==== Issues with Submodules
cs: ==== Problémy se submoduly

source: ==== Lightweight Tags
cs: ==== Prosté značky

source: ==== Limiting Log Output
cs: ==== Omezení výstupu logu

source: ==== Listing Your Tags
cs: ==== Výpis značek

source: ==== Local Protocol
cs: ==== Lokální protokol

source: ==== Local Version Control Systems
cs: ==== Lokální systémy správy verzí

source: ==== Long-Running Branches
cs: ==== Větve s dlouhou životností

source: ==== Merge Strategies
cs: ==== Strategie slučování

source: ==== More Interesting Rebases
cs: ==== Zajímavější možnosti přeskládání

source: ==== Nearly Every Operation Is Local
cs: ==== Téměř každá operace je lokální

source: ==== Object Storage
cs: ==== Ukládání objektů

source: ==== Private Managed Team
cs: ==== Soukromý řízený tým

source: ==== Pulling
cs: ==== Stahování

source: ==== Rebase vs. Merge
cs: ==== Přeskládání vs. slučování

source: ==== Remotes
cs: ==== Reference na vzdálené repozitáře

source: ==== Removing and Renaming Remotes
cs: ==== Odstraňování a přejmenovávání vzdálených repozitářů

source: ==== Reordering Commits
cs: ==== Změna pořadí revizí

source: ==== Server Configuration
cs: ==== Konfigurace serveru

source: ==== Server-Side Hook
cs: ==== Zásuvný modul na straně serveru

source: ==== Server-Side Hooks
cs: ==== Zásuvné moduly na straně serveru

source: ==== Short Status
cs: ==== Zkrácený výpis stavu

source: ==== Showing Your Remotes
cs: ==== Zobrazení vzdálených serverů

source: ==== Single Revisions
cs: ==== Jednotlivé revize

source: ==== Skipping the Staging Area
cs: ==== Přeskočení oblasti připravených změn

source: ==== Small Setups
cs: ==== Nastavení pro malou skupinu

source: ==== Snapshots, Not Differences
cs: ==== Snímky, nikoli rozdíly

source: ==== Splitting a Commit
cs: ==== Rozdělení revize

source: ==== Staging Modified Files
cs: ==== Příprava změněných souborů k zapsání

source: ==== Staging Patches
cs: ==== Příprava záplat

source: ==== Staging and Unstaging Files
cs: ==== Příprava souborů k zapsání a jejich vracení

source: ==== Stashing Your Work
cs: ==== Odložení práce

source: ==== Summary
cs: ==== Shrnutí

source: ==== Tagging Later
cs: ==== Dodatečné označení

source: ==== Tags
cs: ==== Značky

source: ==== The Basic Rebase
cs: ==== Základní přeskládání

source: ==== The Dumb Protocol
cs: ==== Hloupý protokol

source: ==== The Git Protocol
cs: ==== Protokol Git

source: ==== The Nuclear Option: filter-branch
cs: ==== Pitbul mezi příkazy: filter-branch

source: ==== The SSH Protocol
cs: ==== Protokol SSH

source: ==== The Smart Protocol
cs: ==== Chytrý protokol

source: ==== The Three States
cs: ==== Tři stavy

source: ==== Unmodifying a Modified File
cs: ==== Rušení změn ve změněných souborech

source: ==== Verifying Tags
cs: ==== Ověřování značek

source: ==== Workflows Summary
cs: ==== Shrnutí pracovních postupů

source: ==== Working in Topic Branches
cs: ==== Práce v tématických větvích

source: ==== Your Editor
cs: ==== Váš editor

source: ==== Your Identity
cs: ==== Vaše totožnost

source: ===== Applying a Patch with apply
cs: ===== Aplikace záplaty příkazem „apply“

source: ===== Committing-Workflow Hooks
cs: ===== Zásuvné moduly k zapisování revizí

source: ===== Creating a New SVN Branch
cs: ===== Vytvoření nové větve SVN

source: ===== Diffing Binary Files
cs: ===== Nástroj diff pro binární soubory

source: ===== Double Dot
cs: ===== Dvě tečky

source: ===== Downloading Data
cs: ===== Stahování dat

source: ===== Enforcing a User-Based ACL System
cs: ===== Systém ACL podle uživatelů

source: ===== Identifying Binary Files
cs: ===== Identifikace binárních souborů

source: ===== Large-Merging Workflows
cs: ===== Pracovní postupy se začleňováním velkého objemu dat

source: ===== Making a Subdirectory the New Root
cs: ===== Povýšení podadresáře na nový kořenový adresář

source: ===== Merging Workflows
cs: ===== Pracovní postupy založené na slučování

source: ===== Multiple Points
cs: ===== Několik bodů

source: ===== SSH Access
cs: ===== SSH přístup

source: ===== The Cons
cs: ===== Nevýhody

source: ===== The Pros
cs: ===== Výhody

source: ===== Uploading Data
cs: ===== Upload dat

source: A SHA-1 hash looks something like this:
cs: Otisk SHA-1 může vypadat například takto:

source: A branch in Git is simply a lightweight movable pointer to one of these commits.
cs: Větev je v Gitu jen snadno přemístitelným ukazatelem na jeden z těchto objektů revize.

source: A cherry-pick in Git is like a rebase for a single commit.
cs: Částečné převzetí lze v systému Git přirovnat k přeskládání jedné revize.

source: A common issue arises in these scenarios: you want to be able to treat the two projects as separate yet still be able to use one from within the other.
cs: V obou případech se budete potýkat se stejným problémem: oba projekty chcete zachovat samostatné, a přesto potřebujete používat jeden v rámci druhého.

source: A common switch to use with the `log` command in this case is `--left-right`, which shows you which side of the range each commit is in.
cs: Přepínačem, který se v tomto případě běžně používá v kombinaci s příkazem `log`, je parametr `--left-right`. Příkaz pak zobrazí, na jaké straně intervalu se ta která revize nachází.

source: A contributor clones that repository and makes changes.
cs: Přispěvatel naklonuje tento repozitář a provede změny.

source: A few prebuilt options are available for you to use.
cs: K dispozici máte několik přednastavených možností.

source: A higher probability exists that every member of your programming team will be attacked and killed by wolves in unrelated incidents on the same night.
cs: To už je pravděpodobnější, že všichni členové vašeho programovacího týmu budou během jedné noci v navzájem nesouvisejících incidentech napadeni a zabiti smečkou vlků.

source: A huge number and variety of options to the `git log` command are available to show you exactly what you're looking for.
cs: Příkaz `git log` disponuje velkým množstvím nejrůznějších voleb, díky nimž můžete zobrazit přesně to, co potřebujete.

source: A lightweight tag is very much like a branch that doesn't change – it's just a pointer to a specific commit.
cs: Prostá značka se velmi podobá větvi, která se nemění -- je to pouze ukazatel na konkrétní revizi.

source: A local repository is fast only if you have fast access to the data.
cs: Lokální repozitář je rychlý pouze v případě, že máte rychlý přístup k datům.

source: A lot of people become concerned at some point that they will, by random happenstance, have two objects in their repository that hash to the same SHA-1 value.
cs: Někteří uživatelé bývají zmateni, že mohou mít v repozitáři – shodou okolností – dva objekty, které mají stejnou hodnotu SHA-1 otisku.

source: A number of developers are nodes – consumers of that hub – and synchronize to that one place.
cs: Několik vývojářů představuje uzly -- konzumenty centrálního úložiště --, které se synchronizují se podle tohoto místa.

source: A number of options can help you set the coloring to your preference.
cs: S individuálním nastavením barev vám pomůže celá řada možností.

source: A remote repository is generally a _bare repository_ – a Git repository that has no working directory.
cs: Vzdáleným repozitářem je obvykle _holý repozitář_ (bare repository), tj. gitový repozitář bez pracovního adresáře.

source: A repository on NFS is often slower than the repository over SSH on the same server, allowing Git to run off local disks on each system.
cs: Repozitář na NFS je často pomalejší než stejný repozitář nad SSH na tomtéž serveru, který ve všech systémech umožňuje spustit Git z lokálních disků.

source: A second method is to create a single 'git' user on the machine, ask every user who is to have write access to send you an SSH public key, and add that key to the `~/.ssh/authorized_keys` file of your new 'git' user.
cs: Druhým způsobem je vytvořit na počítači jediného uživatele 'git', požádat všechny uživatele, kteří mají mít oprávnění k zápisu, aby vám poslali veřejný SSH klíč, a přidat tento klíč do souboru `~/.ssh/authorized_keys` vašeho nového uživatele 'git'.

source: A simple way to get the commit message from a commit when you have the SHA-1 value is to go to the first blank line and take everything after that.
cs: Jednoduchým způsobem, jak z revize, k níž máte hodnotu SHA-1, extrahovat její zprávu, je přejít k prvnímu prázdnému řádku a vzít vše, co následuje za ním.

source: A single tree object contains one or more tree entries, each of which contains a SHA-1 pointer to a blob or subtree with its associated mode, type, and filename.
cs: Jeden objekt stromu obsahuje jednu nebo více položek stromu, z nichž každá obsahuje ukazatel SHA-1 na blob nebo podstrom s asociovaným režimem, typem a názvem souboru.

source: A topic branch is a short-lived branch that you create and use for a single particular feature or related work.
cs: Tématická větev (topic branch) je krátkodobá větev, kterou vytvoříte a používáte pro jediný konkrétní účel nebo práci.

source: Adding the `-a` option to the `git commit` command makes Git automatically stage every file that is already tracked before doing the commit, letting you skip the `git add` part:
cs: Přidáte-li k příkazu `git commit` parametr `-a`, Git do revize automaticky zahrne každý soubor, který je sledován. Odpadá potřeba zadávat příkaz `git add`:

source: Additionally, if you're using Fedora/RHEL/RHEL-derivatives, you need to do this
cs: Pokud používáte Fedora/RHEL/RHEL-deriváty, musíte navíc provést následující příkaz

source: Administrators have fine-grained control over who can do what; and it's far easier to administer a CVCS than it is to deal with local databases on every client.
cs: Administrátoři mají přesnou kontrolu nad tím, co kdo může dělat. A správa centrálního systému pro správu verzí je mnohem jednodušší, než potýkání se s lokálními databázemi na jednotlivých počítačích.

source: After all this is set, if you run diff commands such as this:
cs: Až dokončíte celé nastavení, můžete spustit příkaz diff, např.:

source: After it's tested, merge the hotfix branch, and push to production.
cs: Po otestování začleníte větev s opravou a odešlete ji do produkce.

source: After that come the line number and the content of the file.
cs: Za tímto údajem následuje číslo řádku a obsah souboru.

source: After the entire commit process is completed, the `post-commit` hook runs.
cs: Po dokončení celého procesu zapisování revize se spustí zásuvný modul `post-commit`.

source: After the integrators merge these branches into the mainline, a fetch will bring down the new merge commit, making the history look like this:
cs: Poté, co integrátoři uvedené větve začlení do hlavní linie, bude možné vyzvednout (fetch) nový bod sloučení (merge commit) a historie revizí bude vypadat takto:

source: After this comes a Commands section.
cs: Za seznamem změn následuje část Commands (Příkazy).

source: After this is done, you can also get Git via Git itself for updates:
cs: Po dokončení instalace můžete vyhledat aktualizace Gitu prostřednictvím jeho samého:

source: After this is done, you can use `git send-email` to send your patches:
cs: Jakmile je to hotové, můžete záplaty odeslat příkazem `git send-email`:

source: After you do this, you should have references to all the branches from that remote, which you can merge in or inspect at any time.
cs: Poté byste měli mít k dispozici odkazy na všechny větve tohoto vzdáleného projektu. Od toho okamžiku je můžete kdykoli slučovat (merge) nebo prohlížet.

source: After you exit the merge tool, Git asks you if the merge was successful.
cs: Po zavření nástroje pro slučování se vás Git zeptá, zda sloučení proběhlo úspěšně.

source: After you have created several commits, or if you have cloned a repository with an existing commit history, you'll probably want to look back to see what has happened.
cs: Po vytvoření několika revizí{empty}footnote:[Pozn. překl.: Znovu připomeňme, že slovem _revize_ je přeložen anglický pojem _commit_ (jako podstatné jméno). Při snaze o vytvoření přesnější představy používám dvouslovný pojem _objekt revize_, který má stejný význam. Uvažujte o něm jako o reprezentantovi výsledku příkazu `git commit`.], nebo pokud jste naklonovali repozitář s existující historií revizí, můžete chtít nahlédnout do historie projektu.

source: After you run a successful `git checkout`, the `post-checkout` hook runs; you can use it to set up your working directory properly for your project environment.
cs: Po úspěšném spuštění příkazu `git checkout` se spustí zásuvný modul `post-checkout`. Ten slouží k nastavení pracovního adresáře podle potřeb prostředí vašeho projektu.

source: After you've resolved each of these sections in each conflicted file, run `git add` on each file to mark it as resolved.
cs: Po vyřešení všech označených částí ve všech souborech s konfliktem, spusťte pro každý soubor příkaz `git add`, kterým ho označíte jako vyřešený.

source: After your super-important fix is deployed, you're ready to switch back to the work you were doing before you were interrupted.
cs: Po zveřejnění veledůležité opravy se můžete přepnout zpět na práci, které jste se věnovali před jejím přerušením.

source: Again, having multiple long-running branches isn't necessary, but it's often helpful, especially when you're dealing with very large or complex projects.
cs: Zopakujme, že není nutné používat několik dlouhotrvajících větví, ale často to může být užitečné, zejména pokud se jedná o velmi velké nebo složité projekty.

source: Again, the public keys look something like this:
cs: Veřejné klíče vypadají opět nějak takto:

source: Again, this generally does nothing.
cs: I tentokrát platí, že příkaz většinou neprovede nic.
